app/controllers/classifications_controller.rb

SELECT * FROM `classifications`
---
  def index
    @classifications = Classification.all

SELECT * FROM `classifications` WHERE (`classifications`.`id` = 1)
---
  def show
    @classification = Classification.find(params[:id])

INSERT INTO `classifications` (`driver_id`, `updated_at`, `time`, `venue_id`, `created_at`) VALUES(1, '2009-05-25 14:57:08', '2009-05-25 01:34:00', 1, '2009-05-25 14:57:08')
---
  def create
    @classification = Classification.new(params[:classification])

    respond_to do |format|
      if @classification.save