app/controllers/venues_controller.rb

SELECT * FROM `venues` WHERE (`venues`.`id` = 1)
---
  def show
    @venue = Venue.find(params[:id])

INSERT INTO `venues` (`name`, `updated_at`, `date`, `location`, `created_at`) VALUES('Australian Grand Prix', '2009-05-25 14:37:14', '2009-03-29', 'Melbourne', '2009-05-25 14:37:14')
---
  def create
    @venue = Venue.new(params[:venue])

    respond_to do |format|
      if @venue.save